{
  "backend/main.mo": "Main Motoko actor implementing member registration system with CRUD operations, pagination, time-based filtering (today/week/month), and admin-only access control using MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting three completed features related to replacing hardcoded admin password with configurable authentication, adding password config file, and implementing Hindi error messages.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration files for the NGO website with member registration and admin dashboard.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system with warm saffron/orange and earthy green palette, supporting both light and dark modes with custom CSS variables.",
  "frontend/index.html": "HTML entry point with bilingual title 'जन कल्याण एकता संगठन - Jan Kalyan Ekta Sangathan' and root div for React mounting.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with home and admin routes, QueryClient for data fetching, ErrorBoundary, and Toaster for notifications.",
  "frontend/src/components/admin/BulkNotificationDialog.tsx": "Dialog component for composing bulk notifications to selected members with subject and message fields; UI-only feature with no actual sending functionality.",
  "frontend/src/components/admin/DeleteMemberDialog.tsx": "Alert dialog component for confirming member deletion with useDeleteMember hook integration, showing member name/ID and handling async deletion with toast notifications.",
  "frontend/src/components/admin/EditMemberDialog.tsx": "Dialog component for editing member information with a form containing fields for name, email, phone, district/state, and message. Uses useUpdateMember hook to persist changes and displays toast notifications for success/error states.",
  "frontend/src/components/admin/ExportButton.tsx": "Button component that exports member data to a CSV file with headers for ID, name, email, phone, location, message, status, and registration date. Creates a downloadable file with timestamp in the filename.",
  "frontend/src/components/admin/MemberSearch.tsx": "Search input component with a search icon and clear button that allows filtering members by name, email, phone, or location. Provides controlled input with value and onChange props.",
  "frontend/src/components/admin/MemberTable.tsx": "Data table component displaying member records with columns for ID, name, email, phone, location, status, and registration date. Supports row selection, bulk actions, inline status updates, and individual edit/delete actions via dropdown menu.",
  "frontend/src/components/admin/PaginationControls.tsx": "Pagination controls component with page size selector (10/25/50/100 rows) and previous/next navigation buttons. Displays current page number and total pages.",
  "frontend/src/components/admin/PasswordAuth.tsx": "Password authentication component that guards admin dashboard access by validating against ADMIN_PASSWORD constant. Stores authentication state in sessionStorage and displays a centered login card.",
  "frontend/src/components/admin/StatisticsCards.tsx": "Dashboard statistics cards displaying total members, registrations today, this week, and this month. Uses multiple query hooks to fetch data and shows loading skeletons while data is being fetched.",
  "frontend/src/components/admin/StatusBadge.tsx": "Badge component that displays member status (active/pending/inactive) with appropriate styling variants. Active status uses green color scheme.",
  "frontend/src/components/admin/StatusDropdown.tsx": "Dropdown select component for changing member status between active, pending, and inactive. Uses useUpdateMemberStatus hook to persist changes with toast notifications.",
  "frontend/src/components/admin/StatusFilter.tsx": "Select dropdown component for filtering members by status (all/active/pending/inactive). Provides controlled selection with value and onChange props.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component displaying bilingual error UI with reload button and error details when application crashes.",
  "frontend/src/components/layout/SiteFooter.tsx": "Site footer component displaying organization name in English and Hindi, tagline, copyright notice, and attribution link to caffeine.ai. Uses content from localized content file.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header component with logo, navigation menu (desktop/mobile), scroll detection, smooth scrolling to sections, and admin button. Includes responsive mobile menu toggle.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact form section with email, phone, address cards and a message submission form. Includes form validation, loading states, success notifications, and simulated submission.",
  "frontend/src/components/sections/GoalSection.tsx": "Displays organization's goal (10 crore members) with decorative cards highlighting core values of honesty and unity. Uses Target icon and gradient styling.",
  "frontend/src/components/sections/HeroSection.tsx": "Full-height hero section with background image overlay, organization name, tagline, quote, and scroll-to-welcome button. Features gradient overlay and centered content layout.",
  "frontend/src/components/sections/MemberRegistrationSection.tsx": "Member registration form with fields for name, phone, email, district/state, and message. Integrates with useRegisterMember mutation hook, displays success message with member ID, and includes validation.",
  "frontend/src/components/sections/OneRupeeSupportSection.tsx": "Section explaining the one rupee support concept with decorative Coins icon and centered card layout displaying content from the Hindi content file.",
  "frontend/src/components/sections/ValuesSection.tsx": "Displays organization's four core values (unity, transparency, humanity, justice) with numbered cards, icons image, and explanatory text. Features grid layout with hover effects.",
  "frontend/src/components/sections/WelcomeMissionSection.tsx": "React component displaying the organization's welcome message, mission statement, and three mission highlights (community support, legal aid, humanitarian approach) with icons and cards.",
  "frontend/src/config/auth.ts": "Exports admin password configuration, defaulting to 'admin123' or environment variable VITE_ADMIN_PASSWORD for simple password-based authentication.",
  "frontend/src/content/hi.ts": "Contains all Hindi language content for the application including organization name, mission, values, quotes, and UI messages used throughout the site.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance with Internet Identity authentication, handling actor initialization and query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including member registration, retrieval, updates, deletion, and statistics queries with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette using saffron/orange theme for light and dark modes, defining CSS variables for UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with password authentication, member search/filtering, pagination, bulk operations, and member management table with statistics cards.",
  "frontend/src/pages/HomePage.tsx": "Main homepage component that renders the full single-page layout with header, footer, and seven lazy-loaded sections (Hero, Welcome/Mission, Goal, One Rupee Support, Values, Member Registration, Contact) wrapped in Suspense boundaries.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color system using OKLCH color space, extended theme with custom fonts, border radii, shadows, and keyframe animations for accordion and other UI components.",
  "project_state.json": "Project metadata tracking 19 versions of an NGO website for \"डिजिटल भारत एकता संगठन\" with 10 implemented features including responsive layout, Hindi content display, visual theming, contact forms, and member registration, plus one known domain validation issue with Devanagari characters."
}