{
  "backend/main.mo": "Empty Motoko actor with no methods or state; serves as a minimal backend placeholder.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: updating the organization name in Hindi content and English transliteration across frontend files.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the NGO website structure, components, and content with the updated organization name 'जन कल्याण संगठन'.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system with warm saffron/orange and green palette, supporting both light and dark modes.",
  "frontend/index.html": "HTML entry point with bilingual title 'जन कल्याण संगठन - Jan Kalyan Sangathan' and root div for React mounting.",
  "frontend/src/App.tsx": "Main React component orchestrating the single-page NGO website layout with header, seven content sections, footer, and toast notifications.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component displaying bilingual organization name, tagline, copyright, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header with logo, organization name, responsive navigation menu for seven sections, and smooth scroll functionality for desktop and mobile.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact section with info cards (email, phone, address) and a demo form with validation, simulated submission, and toast feedback.",
  "frontend/src/components/sections/GoalSection.tsx": "Goal section displaying the target of 1,00,000 honest partners with prominent card styling and supporting content about unity and honesty.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with background image overlay, large organization name, tagline, inspirational quote, and scroll-to-welcome call-to-action button.",
  "frontend/src/components/sections/MemberRegistrationSection.tsx": "React component that renders a member registration form with fields for name, phone, email, district/state, and message. Includes client-side validation, simulated form submission with success feedback, and toast notifications.",
  "frontend/src/components/sections/OneRupeeSupportSection.tsx": "React component displaying the \"₹1 Support\" section explaining how collective micro-donations work. Renders content from Hindi content file in a card layout with a Coins icon.",
  "frontend/src/components/sections/ValuesSection.tsx": "React component showcasing the organization's four core values (Unity, Transparency, Humanity, Justice) with icons, cards, and Hindi text from the content file.",
  "frontend/src/components/sections/WelcomeMissionSection.tsx": "React component displaying welcome message, organizational quote, mission statement, and three mission highlights (Community Support, Legal Aid, Humanitarian Approach) with icons and cards.",
  "frontend/src/content/hi.ts": "Content configuration file exporting Hindi language strings for the NGO website including organization name, mission, values, tagline, and one-rupee support explanation.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor instance based on Internet Identity authentication state, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook file for future backend data fetching integration; currently returns an empty object.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a saffron/orange color palette for light and dark modes, plus base styling for smooth scrolling and typography.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers, then renders the main App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining dark mode, content paths, custom theme extensions including color system using OKLCH, typography, container settings, border radius variables, and animation keyframes.",
  "project_state.json": "Project state tracking file documenting an NGO website for \"डिजिटल भारत एकता संगठन\" with 9 existing features including responsive layout, Hindi content display, visual theming, contact form, static images, and a ₹1 contribution explanation section, plus one known domain validation issue with Hindi characters."
}