{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Metadata listing implemented features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for reference.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables and light/dark theme colors.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component rendering the full single‑page layout with all sections and header/footer.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying organization info, tagline, copyright, and caffeine.ai attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header with logo and navigation including scroll‑to‑section behavior and mobile menu.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact info and form with basic client‑side validation and simulated submission feedback.",
  "frontend/src/components/sections/GoalSection.tsx": "Goal section highlighting the organization’s target and supporting mission cards.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with background image, organization name, tagline, quote, and learn‑more button.",
  "frontend/src/components/sections/MemberRegistrationSection.tsx": "Renders a member registration form with client-side validation, simulated submission, and success feedback using UI components.",
  "frontend/src/components/sections/OneRupeeSupportSection.tsx": "Displays a section explaining the ₹1 support concept using localized content inside styled cards.",
  "frontend/src/components/sections/ValuesSection.tsx": "Shows organizational values with localized text, icons, and a grid of value cards.",
  "frontend/src/components/sections/WelcomeMissionSection.tsx": "Renders a welcome message, mission statement, quote, and mission highlights using localized content.",
  "frontend/src/content/hi.ts": "Provides Hindi-language content strings for organization text, values, mission, and support information.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook, managing identity state, login, and persistence.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook for future backend queries; currently returns an empty object.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for a saffron-themed light/dark color palette.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom fonts, OKLCH-based color tokens, extended theming, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing the NGO website requirements, existing features, known issues, and metadata for build planning."
}