{
  "backend/main.mo": "Main Motoko actor implementing member registration and management with access control, including CRUD operations, pagination, time-based filtering (today/week/month), and admin-only query endpoints.",
  "feature_evidence.json": "Feature evidence report mapping features to files, components, and test IDs, focusing on blank page investigation, routing configuration, component imports, actor initialization, and error boundary implementation.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration, describing the NGO website structure with member registration, admin dashboard, and Hindi/English bilingual content.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system with saffron/orange and green palette for light and dark modes, including custom CSS variables for UI components.",
  "frontend/index.html": "HTML entry point with bilingual title 'जन कल्याण एकता संगठन - Jan Kalyan Ekta Sangathan' and root div for React mounting.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with home and admin routes, wrapped in QueryClientProvider and ErrorBoundary with Toaster for notifications.",
  "frontend/src/components/admin/BulkNotificationDialog.tsx": "Dialog component for composing bulk notifications to selected members with subject and message fields; UI-only feature with no actual sending functionality.",
  "frontend/src/components/admin/DeleteMemberDialog.tsx": "Alert dialog component for confirming member deletion with mutation hook integration and success/error toast notifications.",
  "frontend/src/components/admin/EditMemberDialog.tsx": "Dialog component for editing member information with a form containing fields for name, email, phone, district/state, and message. Uses useUpdateMember hook to persist changes and displays toast notifications for success/error states.",
  "frontend/src/components/admin/ExportButton.tsx": "Button component that exports member data to a CSV file with headers for ID, name, email, phone, location, message, status, and registration date. Creates a downloadable file with timestamp in the filename.",
  "frontend/src/components/admin/MemberSearch.tsx": "Search input component with a search icon and clear button that allows filtering members by name, email, phone, or location. Provides controlled input with value and onChange props.",
  "frontend/src/components/admin/MemberTable.tsx": "Table component displaying member data with columns for ID, name, email, phone, location, status, and registration date. Supports row selection via checkboxes, inline status updates, and row actions (edit/delete) through dropdown menus.",
  "frontend/src/components/admin/PaginationControls.tsx": "Pagination controls component with page size selector (10/25/50/100 rows) and previous/next navigation buttons. Displays current page number and total pages.",
  "frontend/src/components/admin/PasswordAuth.tsx": "Password authentication component that checks for hardcoded admin password ('admin123') and stores authentication state in sessionStorage. Displays a centered card with password input form.",
  "frontend/src/components/admin/StatisticsCards.tsx": "Dashboard statistics cards displaying total members, registrations today, this week, and this month. Uses multiple query hooks to fetch data and shows loading skeletons while data is being fetched.",
  "frontend/src/components/admin/StatusBadge.tsx": "Badge component that displays member status (active/pending/inactive) with appropriate styling variants. Active status uses green color scheme.",
  "frontend/src/components/admin/StatusDropdown.tsx": "Dropdown select component for changing member status between active, pending, and inactive. Uses useUpdateMemberStatus hook and displays toast notifications on success/error.",
  "frontend/src/components/admin/StatusFilter.tsx": "Dropdown filter component for filtering members by status (all/active/pending/inactive). Provides controlled select input with value and onChange props.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches rendering errors and displays a bilingual error message with reload button and error details.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component displaying organization name in English and Hindi, tagline, copyright notice, and attribution link to caffeine.ai with UTM parameters. Uses content from localized content file.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header component with logo, navigation menu (desktop/mobile), scroll detection, and smooth scrolling to page sections. Includes admin button and responsive mobile menu toggle.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact form section with validation, submission handling, and contact info cards (email, phone, address). Displays success/error toasts and resets form after submission.",
  "frontend/src/components/sections/GoalSection.tsx": "Displays organization goal with large centered text, target icon, and two supporting value cards (honesty and unity) in a grid layout.",
  "frontend/src/components/sections/HeroSection.tsx": "Full-screen hero section with background image overlay, organization name, tagline, quote, and scroll-to-welcome button with smooth scrolling.",
  "frontend/src/components/sections/MemberRegistrationSection.tsx": "Member registration form with fields for name, phone, email, district/state, and message. Uses mutation hook for API submission and displays success message with member ID.",
  "frontend/src/components/sections/OneRupeeSupportSection.tsx": "Simple section displaying the \"₹1 support\" concept with coin icon, title, and body text in a centered card layout.",
  "frontend/src/components/sections/ValuesSection.tsx": "Displays organization values with large centered text, values icon image, and grid of four numbered value cards (unity, transparency, humanity, justice).",
  "frontend/src/components/sections/WelcomeMissionSection.tsx": "Displays the welcome header, mission quote, and mission statement with three highlighted cards (community support, legal aid, humanitarian approach) using Hindi content from the content file.",
  "frontend/src/content/hi.ts": "Contains all Hindi language content for the organization including names, mission statements, values, taglines, and success messages used throughout the application.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication with Internet Identity and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing identity state and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including member registration, retrieval (paginated, filtered by date), updates, deletions, and count queries with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a saffron/orange color palette for light and dark themes, suitable for an NGO website aesthetic.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with password authentication, member statistics, search/filter functionality, paginated member table, bulk selection, and export capabilities for managing registered members.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that composes all public-facing sections (hero, mission, goals, values, registration, contact) with Suspense boundaries and loading skeletons for each section.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color system using OKLCH color space, container settings, font families, border radius variables, and animation keyframes for accordion components.",
  "project_state.json": "Project state tracking for an NGO website \"डिजिटल भारत एकता संगठन\" with 7 existing features including responsive layout, Hindi content display, visual theming, contact form, static images, and a ₹1 support explanation section; notes production deployment issues with Hindi domain names and blank website rendering."
}