{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented methods or state.",
  "feature_evidence.json": "Feature evidence report documenting three completed features that updated the organization name from 'Jan Kalyan Sangathan' to 'Jan Kalyan Ekta Sangathan' across Hindi content, HTML title, and documentation comments.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the NGO website structure with updated organization name 'जन कल्याण एकता संगठन', including components for header, footer, hero, sections, forms, and styling.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system with warm saffron/orange and earthy green palette, supporting both light and dark modes with custom CSS variables for all UI tokens.",
  "frontend/index.html": "HTML entry point with document title displaying both Hindi and English organization names 'जन कल्याण एकता संगठन - Jan Kalyan Ekta Sangathan' and mounting point for React app.",
  "frontend/src/App.tsx": "Main React application component orchestrating the complete single-page NGO website layout with header, seven content sections (hero, welcome/mission, goal, one rupee support, values, member registration, contact), footer, and toast notifications.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component displaying organization name in both English and Hindi, tagline, copyright notice, and attribution link to caffeine.ai with UTM tracking.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header with logo, organization name 'जन कल्याण एकता संगठन', responsive navigation menu with smooth scroll-to-section functionality for both desktop and mobile views, and scroll-based styling.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact section with contact information cards (email, phone, address) and a demo contact form featuring client-side validation, simulated submission, and toast notifications for user feedback.",
  "frontend/src/components/sections/GoalSection.tsx": "Goal section prominently displaying the target of 1,00,000 honest partners with visual emphasis using cards, icons, and supporting content cards highlighting honesty and unity values.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with background image overlay, large organization name, tagline, inspirational quote, and call-to-action button with smooth scroll to welcome section.",
  "frontend/src/components/sections/MemberRegistrationSection.tsx": "React component that renders a member registration form with fields for name, phone, email, district/state, and message. Includes client-side validation, simulated form submission with toast notifications, and success state handling.",
  "frontend/src/components/sections/OneRupeeSupportSection.tsx": "React component displaying the \"₹1 Support\" section explaining how collective micro-donations work. Uses content from Hindi localization file and renders a card with icon and formatted text.",
  "frontend/src/components/sections/ValuesSection.tsx": "React component showcasing the organization's four core values (Unity, Transparency, Humanity, Justice) with icons, cards, and Hindi/English labels. Includes a values icon image and explanatory text.",
  "frontend/src/components/sections/WelcomeMissionSection.tsx": "React component displaying welcome message, organizational quote, and mission statement with three highlighted service areas (Community Support, Legal Aid, Humanitarian Approach). Uses Hindi content from localization file.",
  "frontend/src/content/hi.ts": "Hindi language content configuration file exporting all text strings for the NGO website including organization name, mission, values, tagline, and rupee support explanation.",
  "frontend/src/hooks/useActor.ts": "React hook managing Internet Computer actor creation with authentication support. Handles both authenticated and anonymous actors, invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication on ICP. Manages login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook file for future backend data fetching integration. Currently returns empty object as backend has no methods yet.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a saffron/orange color palette for light and dark modes. Includes base styles for smooth scrolling and typography.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for ICP authentication, then renders the App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, custom color system using OKLCH variables, extended typography, container settings, border radius variables, and animation keyframes for accordion and other UI components.",
  "project_state.json": "Project state tracking file documenting an NGO website for \"डिजिटल भारत एकता संगठन\" with 11 implemented features including responsive layout, Hindi content display, visual theming, contact form, static images, and various content sections, plus one known domain validation issue with Devanagari characters."
}