{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add simple password protection to admin dashboard",
  "requirements": [
    {
      "id": "REQ-43",
      "summary": "Update PasswordAuth component to use configurable password from environment variable or configuration instead of hardcoded value",
      "acceptanceCriteria": [
        "Password is stored in a configuration file or environment variable instead of being hardcoded",
        "Admin can change the password without modifying component code",
        "Password input and validation logic remains unchanged"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/PasswordAuth.tsx",
          "operation": "modify",
          "description": "Replace hardcoded 'admin123' password with a configurable password imported from the configuration file. Update the password validation logic to compare against the imported ADMIN_PASSWORD constant while maintaining existing sessionStorage-based authentication flow and UI structure."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Add password configuration to a centralized location for admin authentication",
      "acceptanceCriteria": [
        "Password is stored in a centralized location",
        "Configuration is easy to locate and update",
        "Password remains functional with existing PasswordAuth component"
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/auth.ts",
          "operation": "create",
          "description": "Create new configuration file that exports ADMIN_PASSWORD constant. This constant should be set to a default value (e.g., 'admin123') but can be overridden via environment variables. Include a comment explaining how to change the password for production use."
        }
      ]
    },
    {
      "id": "REQ-45",
      "summary": "Add Hindi error message for incorrect password attempts in admin authentication",
      "acceptanceCriteria": [
        "Error message is stored in the Hindi content file",
        "Message clearly indicates incorrect password in Hindi",
        "PasswordAuth component can reference this message"
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/hi.ts",
          "operation": "modify",
          "description": "Add a new auth section to the content object containing an incorrectPasswordError message in Hindi (e.g., 'गलत पासवर्ड। कृपया पुनः प्रयास करें।'). This message should be clear and user-friendly for incorrect password attempts."
        },
        {
          "path": "frontend/src/components/admin/PasswordAuth.tsx",
          "operation": "modify",
          "description": "Import the Hindi content file and use the incorrectPasswordError message from the auth section when displaying password validation errors. Update the error state handling to reference this localized error message instead of any hardcoded English text."
        }
      ]
    }
  ]
}